In [7]:
import pandas as pd
import sqlalchemy

engine = sqlalchemy.create_engine('postgresql://matteast@localhost:5432/northwind')
%config Completer.use_jedi = False

# SQL Group Functions
- Group Functions
- Group By + Having
- Sub Queries

*Group Functions* typically live in the *Post Processing* step of the *Interim Answer Set*.

## The Group Function 
- SQL creates and interim answer set
- SQL processes the group function against the interim answer set
- Final answer set contains only the final results for the function

## Group Functions with a WHERE clause
- The *WHERE* clause determins the number of rows in the *Interim Answer Set* (The first part)
- The *Group Function* does its calculations against the rows in the *Interim Answer Set* after the *WHERE* is done

## SQL Five Group Functions
- SUM Sums the non-null values in a column
- AVG Calculates the average of the non-null values in a column
- COUNT Counts how any rows have a non-null value in a column
- MIN Returns the lowest non-null value in a column
- MAX Returns the highest non-null value in a column

### Also:
- SUM & AVG can only be used with NUMERIC columns
- MIN & MAX can only be used with DATA TYPE columns
- COUNT can be used with ANY data type

In [3]:
# COUNT Group Function

query = """

SELECT COUNT(*) as 'Staff Size'
FROM employees;

"""

df = pd.read_sql(query, engine)
df

   Staff Size
0           9

In [4]:
# COUNT Distinct Group Function

query = """

SELECT COUNT(Distinct Country) as "Countries"
FROM customers;

"""

df = pd.read_sql(query, engine)
df

   Countries
0         21

In [11]:
# SUM Group Function

query = """

SELECT SUM(units_in_stock) AS "Inventory"
FROM products;

"""

df = pd.read_sql(query, engine)
df

   Inventory
0       3119

In [9]:
# MAX Group Function

query = """

SELECT MAX(unit_price) as "High Price"
FROM products;

"""

df = pd.read_sql(query, engine)
df

   High Price
0       263.5

In [12]:
# MIN Group Function

query = """

SELECT MIN(unit_price) as "Low Price"
FROM products;

"""

df = pd.read_sql(query, engine)
df

   Low Price
0        2.5

In [14]:
# AVERAGE Group Function

query = """

SELECT AVG(unit_price) as "Average Price"
FROM products;

"""

df = pd.read_sql(query, engine)
df

   Average Price
0      28.833896

In [20]:
# AVERAGE Group Function + TWO CHAR

query = """

SELECT TO_CHAR(AVG(unit_price), '999,999.99') as "Average Price"
FROM products;

"""

df = pd.read_sql(query, engine)
df

  Average Price
0         28.83